# GetValidCategoriesForEmbeddedSchedule Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..GetValidCategoriesForEmbeddedSchedule Method
ScheduleDefinition Class See Also
---
Get all categories that can be used for an embedded ScheduleDefinition in this ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<ElementId> GetValidCategoriesForEmbeddedSchedule()
```

Visual Basic
---
```text
Public Function GetValidCategoriesForEmbeddedSchedule As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetValidCategoriesForEmbeddedSchedule()
```

# ### Return Value
The IDs of all valid categories.
# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace